tylertms/kinetis-k22-sim/src/device/kinetis_k22/device.c
static bool sysmpu_access_allowed(KinetisK22* device, uint32_t address, uint8_t access_size,
                                  uint8_t master, bool supervisor, K22SysMpuAccess access) {
    if (!k22_profile_has_peripheral(device->profile, K22_PERIPHERAL_SYSMPU) ||
        !k22_io_clock_enabled(&device->io, K22_PERIPHERAL_SYSMPU))
        return true;
    if (!k22_io_sysmpu_access(&device->io, address, master, supervisor, access))
        return false;
    return k22_io_sysmpu_access(&device->io, address + access_size - 1u, master, supervisor,
                                access);
}

static bool memory_read_unprotected(KinetisK22* device, uint32_t address, uint8_t access_size,
                                    CortexM4Access access, uint8_t flash_master_id,
                                    uint32_t* output_value) {
    if (valid_memory_range(address, access_size, K22_FLASH_BASE,
                           device->configuration.flash_size)) {
        if (!is_flash_access_allowed(device, access, flash_master_id, false)) {
            return false;
        }
        if (!k22_data_flash_read(device->data, false, address, access_size)) {
            *output_value = access_size == 4u ? UINT32_MAX : (1u << (access_size * 8u)) - 1u;
            return true;
        }
        if (fmc_cache_enabled(device, 0u, access)) {
            *output_value = 0u;
            for (uint8_t byte_index = 0u; byte_index < access_size; byte_index++) {
                *output_value |= (uint32_t)fmc_cached_byte(device, 0u, address + byte_index, access)
                                 << (byte_index * 8u);
            }
        } else {
            *output_value = 0u;
            for (uint8_t byte_index = 0u; byte_index < access_size; byte_index++) {
                *output_value |=
                    (uint32_t)device
                        ->flash[k22_data_program_flash_address(device->data, address + byte_index)]
                    << (byte_index * 8u);
            }
        }
        return true;
    }
    if (valid_memory_range(address, access_size, device->sram_base,
                           device->configuration.sram_size)) {
        const uint32_t offset = address - device->sram_base;
        if (access != CORTEX_M4_ACCESS_DEBUG) {
            for (uint8_t byte_index = 0u; byte_index < access_size; byte_index++) {
                if (device->sram_initialized[offset + byte_index] == 0u) {
                    if (device->uninitialized_sram_read_count == 0u) {
                        device->first_uninitialized_sram_read = address + byte_index;
                    }
                    device->uninitialized_sram_read_count++;
                }
            }
        }
        *output_value = read_little_endian(device->sram + address - device->sram_base, access_size);
        return true;
    }
    if (device->profile->flexnvm_size != 0u &&
        valid_memory_range(address, access_size, device->profile->flexnvm_address,
                           device->profile->flexnvm_size)) {
        if (!is_flash_access_allowed(device, access, flash_master_id, false))
            return false;
        const uint32_t offset = address - device->profile->flexnvm_address;
        if (!k22_data_flash_read(device->data, true, offset, access_size)) {
            *output_value = access_size == 4u ? UINT32_MAX : (1u << (access_size * 8u)) - 1u;
            return true;
        }
        if (fmc_cache_enabled(device, 1u, access)) {
            *output_value = 0u;
            for (uint8_t byte_index = 0u; byte_index < access_size; byte_index++) {
                *output_value |= (uint32_t)fmc_cached_byte(device, 1u, offset + byte_index, access)
                                 << (byte_index * 8u);
            }
            return true;
        }
        return k22_data_read(device->data, address, access_size, output_value);
    }
    if (device->profile->flexram_size != 0u &&
        valid_memory_range(address, access_size, device->profile->flexram_address,
                           device->profile->flexram_size)) {
        if (!is_flash_access_allowed(device, access, flash_master_id, false))
            return false;
        return k22_data_read(device->data, address, access_size, output_value);
    }
    if (device->flexbus_memory != NULL &&
        valid_memory_range(address, access_size, device->flexbus_address, device->flexbus_size) &&
        k22_io_flexbus_transfer(&device->io, address, access_size, false, 0u)) {
        *output_value = read_little_endian(
            device->flexbus_memory + address - device->flexbus_address, access_size);
        return true;
    }
    return kinetis_k22_peripheral_read(device, address, access_size, access, output_value);
}

static bool memory_write_unprotected(KinetisK22* device, uint32_t address, uint8_t access_size,
                                     CortexM4Access access, uint8_t flash_master_id,
                                     uint32_t write_value) {
    if (valid_memory_range(address, access_size, K22_FLASH_BASE,
                           device->configuration.flash_size)) {
        if (access != CORTEX_M4_ACCESS_DEBUG) {
            return false;
        }
        for (uint8_t byte_index = 0u; byte_index < access_size; byte_index++) {
            device->flash[k22_data_program_flash_address(device->data, address + byte_index)] =
                (uint8_t)(write_value >> (byte_index * 8u));
        }
        fmc_invalidate_line(device, 0u, address);
        fmc_invalidate_line(device, 0u, address + access_size - 1u);
        return true;
    }
    if (valid_memory_range(address, access_size, device->sram_base,
                           device->configuration.sram_size)) {
        const uint32_t offset = address - device->sram_base;
        write_little_endian(device->sram + offset, access_size, write_value);
        memset(device->sram_initialized + offset, 1, access_size);
        return true;
    }
    if (device->profile->flexnvm_size != 0u &&
        valid_memory_range(address, access_size, device->profile->flexnvm_address,
                           device->profile->flexnvm_size)) {
        if (access != CORTEX_M4_ACCESS_DEBUG ||
            !k22_data_write(device->data, address, access_size, write_value))
            return false;
        const uint32_t offset = address - device->profile->flexnvm_address;
        fmc_invalidate_line(device, 1u, offset);
        fmc_invalidate_line(device, 1u, offset + access_size - 1u);
        return true;
    }
    if (device->profile->flexram_size != 0u &&
        valid_memory_range(address, access_size, device->profile->flexram_address,
                           device->profile->flexram_size)) {
        if (!is_flash_access_allowed(device, access, flash_master_id, true))
            return false;
        return k22_data_write(device->data, address, access_size, write_value);
    }
    if (device->flexbus_memory != NULL && !device->flexbus_read_only &&
        valid_memory_range(address, access_size, device->flexbus_address, device->flexbus_size) &&
        k22_io_flexbus_transfer(&device->io, address, access_size, true, write_value)) {
        write_little_endian(device->flexbus_memory + address - device->flexbus_address, access_size,
                            write_value);
        return true;
    }
    return kinetis_k22_peripheral_write(device, address, access_size, access, write_value);
}

bool kinetis_k22_memory_read(KinetisK22* device, uint32_t address, uint8_t access_size,
                             CortexM4Access access, uint32_t* output_value) {
    if (device == NULL || output_value == NULL ||
        (access_size != 1u && access_size != 2u && access_size != 4u))
        return false;
    if (access != CORTEX_M4_ACCESS_DEBUG) {
        const uint8_t master_id = access == CORTEX_M4_ACCESS_INSTRUCTION ? 0u : 1u;
        const bool supervisor = access != CORTEX_M4_ACCESS_UNPRIVILEGED_DATA &&
                                (access != CORTEX_M4_ACCESS_INSTRUCTION || device->cpu == NULL ||
                                 (cortex_m4_get_xpsr(device->cpu) & 0x1ffu) != 0u ||
                                 (cortex_m4_get_control(device->cpu) & 1u) == 0u);
        const K22SysMpuAccess operation =
            access == CORTEX_M4_ACCESS_INSTRUCTION ? K22_SYSMPU_EXECUTE : K22_SYSMPU_READ;
        if (!sysmpu_access_allowed(device, address, access_size, master_id, supervisor, operation))
            return false;
    }
    const uint8_t master_id = access == CORTEX_M4_ACCESS_INSTRUCTION ? 0u : 1u;
    return memory_read_unprotected(device, address, access_size, access, master_id, output_value);
}

bool kinetis_k22_memory_write(KinetisK22* device, uint32_t address, uint8_t access_size,
                              CortexM4Access access, uint32_t write_value) {
    if (device == NULL || (access_size != 1u && access_size != 2u && access_size != 4u))
        return false;
    if (access != CORTEX_M4_ACCESS_DEBUG) {
        const bool supervisor = access != CORTEX_M4_ACCESS_UNPRIVILEGED_DATA;
        if (!sysmpu_access_allowed(device, address, access_size, 1u, supervisor, K22_SYSMPU_WRITE))
            return false;
    }
    return memory_write_unprotected(device, address, access_size, access, 1u, write_value);
}

bool kinetis_k22_dma_read(KinetisK22* device, uint32_t address, uint8_t access_size,
                          uint32_t* output_value) {
    if (device == NULL || output_value == NULL ||
        (access_size != 1u && access_size != 2u && access_size != 4u) ||
        !sysmpu_access_allowed(device, address, access_size, 2u, true, K22_SYSMPU_READ))
        return false;
    return memory_read_unprotected(device, address, access_size, CORTEX_M4_ACCESS_DATA, 2u,
                                   output_value);
}

bool kinetis_k22_dma_write(KinetisK22* device, uint32_t address, uint8_t access_size,
                           uint32_t write_value) {
    if (device == NULL || (access_size != 1u && access_size != 2u && access_size != 4u) ||
        !sysmpu_access_allowed(device, address, access_size, 2u, true, K22_SYSMPU_WRITE))
        return false;
    return memory_write_unprotected(device, address, access_size, CORTEX_M4_ACCESS_DATA, 2u,
                                    write_value);
}

