tylertms/kinetis-k22-sim/src/device/kinetis_k22/device.c
bool kinetis_k22_read(const KinetisK22* device, uint32_t address, void* output_data,
                      size_t data_size) {
    if (device == NULL || output_data == NULL) {
        return false;
    }
    uint8_t* output_bytes = output_data;
    size_t byte_offset = 0u;
    while (byte_offset < data_size) {
        const size_t remaining_bytes = data_size - byte_offset;
        const uint8_t access_size = remaining_bytes >= 4 && ((address + byte_offset) & 3u) == 0 ? 4
                                    : remaining_bytes >= 2 && ((address + byte_offset) & 1u) == 0
                                        ? 2
                                        : 1;
        uint32_t transfer_value = 0u;
        if (!k22_read_bus((KinetisK22*)device, address + (uint32_t)byte_offset, access_size,
                          CORTEX_M4_ACCESS_DEBUG, &transfer_value)) {
            return false;
        }
        write_little_endian(output_bytes + byte_offset, access_size, transfer_value);
        byte_offset += access_size;
    }
    return true;
}

bool kinetis_k22_write(KinetisK22* device, uint32_t address, const void* input_data,
                       size_t data_size) {
    if (device == NULL || input_data == NULL) {
        return false;
    }
    const uint8_t* input_bytes = input_data;
    size_t byte_offset = 0u;
    while (byte_offset < data_size) {
        const size_t remaining_bytes = data_size - byte_offset;
        const uint8_t access_size = remaining_bytes >= 4 && ((address + byte_offset) & 3u) == 0 ? 4
                                    : remaining_bytes >= 2 && ((address + byte_offset) & 1u) == 0
                                        ? 2
                                        : 1;
        const uint32_t transfer_value = read_little_endian(input_bytes + byte_offset, access_size);
        if (!k22_write_bus(device, address + (uint32_t)byte_offset, access_size,
                           CORTEX_M4_ACCESS_DEBUG, transfer_value)) {
            return false;
        }
        byte_offset += access_size;
    }
    return true;
}

bool kinetis_k22_copy(KinetisK22* destination, const KinetisK22* source) {
    if (destination == NULL || source == NULL || destination->profile->id != source->profile->id ||
        destination->package != source->package ||
        destination->configuration.flash_size != source->configuration.flash_size ||
        destination->configuration.sram_size != source->configuration.sram_size) {
        return false;
    }
    memcpy(destination->flash, source->flash, source->configuration.flash_size);
    memcpy(destination->sram, source->sram, source->configuration.sram_size);
    memcpy(destination->sram_initialized, source->sram_initialized,
           source->configuration.sram_size);
    memcpy(destination->peripheral, source->peripheral, K22_PERIPHERAL_SIZE);
    destination->configuration = source->configuration;
    destination->uninitialized_sram_read_count = source->uninitialized_sram_read_count;
    destination->first_uninitialized_sram_read = source->first_uninitialized_sram_read;
    destination->cycles = source->cycles;
    destination->cmt_cycles = source->cmt_cycles;
    destination->cmt_bus_remainder = source->cmt_bus_remainder;
    destination->cmt_mark_ticks = source->cmt_mark_ticks;
    destination->cmt_period_ticks = source->cmt_period_ticks;
    destination->cmt_carrier_high_ticks = source->cmt_carrier_high_ticks;
    destination->cmt_carrier_period_ticks = source->cmt_carrier_period_ticks;
    destination->cmt_carrier_offset_ticks = source->cmt_carrier_offset_ticks;
    destination->cmt_output_delay_ticks = source->cmt_output_delay_ticks;
    destination->cmt_eoc_read = source->cmt_eoc_read;
    destination->cmt_running = source->cmt_running;
    destination->cmt_stop_pending = source->cmt_stop_pending;
    destination->cmt_fsk_secondary = source->cmt_fsk_secondary;
    destination->cmt_extended_space = source->cmt_extended_space;
    destination->cmt_dma_pending = source->cmt_dma_pending;
    memcpy(destination->fmc_bank, source->fmc_bank, sizeof(destination->fmc_bank));
    memcpy(destination->fmc_age, source->fmc_age, sizeof(destination->fmc_age));
    destination->fmc_access_count = source->fmc_access_count;
    (void)k22_usbdcd_copy(&destination->usbdcd, &source->usbdcd);
    memcpy(destination->comparator_output, source->comparator_output,
           sizeof(destination->comparator_output));
    memcpy(destination->events, source->events, sizeof(destination->events));
    destination->event_read_index = source->event_read_index;
    destination->event_write_index = source->event_write_index;
    destination->event_count = source->event_count;
    if (!k22_data_copy(destination->data, source->data) ||
        !k22_sdhc_copy(&destination->sdhc, &source->sdhc, kinetis_k22_sdhc_bus(destination)) ||
        !k22_serial_copy(&destination->serial, &source->serial) ||
        !k22_io_copy(&destination->io, &source->io) ||
        !k22_timing_copy(&destination->timing, &source->timing,
                         kinetis_k22_timing_signals(destination))) {
        return false;
    }
    destination->io.configuration.event_handler =
        kinetis_k22_io_configuration(destination).event_handler;
    destination->io.configuration.event_context = destination;
    if (source->flexbus_memory != NULL) {
        if (!kinetis_k22_flexbus_attach(destination, source->flexbus_address,
                                        source->flexbus_memory, source->flexbus_size,
                                        source->flexbus_read_only))
            return false;
    } else {
        kinetis_k22_flexbus_detach(destination);
    }
    return cortex_m4_copy(destination->cpu, source->cpu);
}

uint64_t kinetis_k22_get_uninitialized_sram_read_count(const KinetisK22* device) {
    return device == NULL ? 0u : device->uninitialized_sram_read_count;
}

uint32_t kinetis_k22_get_first_uninitialized_sram_read(const KinetisK22* device) {
    return device == NULL ? UINT32_MAX : device->first_uninitialized_sram_read;
}

void kinetis_k22_clear_uninitialized_sram_reads(KinetisK22* device) {
    if (device == NULL) {
        return;
    }
    device->uninitialized_sram_read_count = 0u;
    device->first_uninitialized_sram_read = UINT32_MAX;
}

static bool is_live_timing_register(uint32_t address) {
    const bool pit_state = address >= 0x40037104u && address <= 0x4003713cu &&
                           ((address - 0x40037104u) % 0x10u == 0u ||
                            (address - 0x4003710cu) % 0x10u == 0u);
    return pit_state || address == 0x40052010u || address == 0x40052012u;
}

static bool read_comparable_register(KinetisK22* device, uint32_t address, uint8_t size,
                                     uint32_t* value) {
    if (address >= 0x40052000u && address < 0x40052018u) {
        return k22_timing_projected_watchdog_read(&device->timing, address, size, value);
    }
    return kinetis_k22_memory_read(device, address, size, CORTEX_M4_ACCESS_DEBUG, value);
}

